app/controllers/microposts_controller.rb

  def create
      @micropost  = current_user.microposts.build(params[:micropost])
      if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES ('sfhldkj;lv;adgfvasdf', 101, '2012-01-14 12:27:25.782707', '2012-01-14 12:27:25.782707')