app/controllers/users_controller.rb

  def index
      @title = "All users"
      @users = User.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

  def show
     @user = User.find(params[:id])
     @microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 1) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 1)

  def create
     @user = User.new(params[:user])
     if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt", "admin") VALUES ('qwerty', 'qwerty@mail.ru', '2012-01-13 13:33:38.418916', '2012-01-13 13:33:38.418916', 'c139582ea630bb050b1bff2be3b071825912033e507de0d684381f92028a15aa', '7197e8f440e2e9e29befa765a9c7b53fb10103ee085e23240f2a73ada7116c58', 'f')